УТ114.CRM_Monolit/src/InformationRegisters/Mon_ВходящиеДанные/Mon_ВходящиеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Mon_ВходящиеДанные</name>
  <resources>
    <name>ТекстОбмена</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Mon_СтатусыОбработкиСтрокиРегистра</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШлюзОрганизации</name>
    <type>
      <types>CatalogRef.Mon_ШлюзыОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбмена</name>
    <type>
      <types>EnumRef.Mon_ВидыОбменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ114.CRM_Monolit/src/Enums/Mon_СтатусыОбработкиСтрокиРегистра/Mon_СтатусыОбработкиСтрокиРегистра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Mon_СтатусыОбработкиСтрокиРегистра</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОбработаноУспешно</name>
  </enumValues>
  <enumValues>
    <name>ОбработаноСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>НеОбработано</name>
  </enumValues>
</mdclass:Enum>

УТ114.CRM_Monolit/src/InformationRegisters/Mon_ВходящиеДанные/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура СброситьСтатусНаСервере(ШлюзОрганизации,
	ВидОбмена, ДатаЗагрузки, ТекстОбмена, ДатаОбработки)
	// Вставить содержимое обработчика.
	
	НоваяЗапись = РегистрыСведений.Mon_ВходящиеДанные.СоздатьМенеджерЗаписи();
	НоваяЗапись.ШлюзОрганизации	 = ШлюзОрганизации;
	НоваяЗапись.ВидОбмена  = ВидОбмена;
	НоваяЗапись.ДатаЗагрузки = ДатаЗагрузки;
	НоваяЗапись.ТекстОбмена = ТекстОбмена;
	
	НоваяЗапись.Статус = Перечисления.Mon_СтатусыОбработкиСтрокиРегистра.НеОбработано;
	
	НоваяЗапись.ДатаОбработки = ДатаОбработки;
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьСтатус(Команда)
	данные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	СброситьСтатусНаСервере(данные.ШлюзОрганизации,
	данные.ВидОбмена,данные.ДатаЗагрузки,данные.ТекстОбмена, данные.ДатаОбработки);
	ОбновитьОтображениеДанных(ЭтаФорма.ТекущийЭлемент);
	
КонецПроцедуры
